examples/porousHeatTransferFoam/energyRelease/2dLocalHeatSource/constant/V
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "constant";
    object      V;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 0 0 0 0 0];


internalField   nonuniform List<scalar> 
2700
(
0.00215995
0.00215995
0.00215995
0.00215995
0.00215995
0.00215995
0.00215995
0.00215995
...
)
;

boundaryField
{
    openBorder1
    {
        type            calculated;
        value           uniform 0;
    }
    openBorder2
    {
        type            calculated;
        value           uniform 0;
    }
    walls
    {
        type            calculated;
        value           uniform 0;
    }
    symm
    {
        type            symmetryPlane;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
